Revit 2024 API
GroupTypeId.StructuralSectionGeometry Property
 Structural Section Geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId StructuralSectionGeometry { get; }
Visual Basic
Public Shared ReadOnly Property StructuralSectionGeometry As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralSectionGeometry {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace